Repository: Esukhia/Corpora
Catalog: Parallel/84000/Toh_176-Vimalakirtinirdesa-v1.tmx
Source language: bo
Languages: en

source: སངས་རྒྱས་དང་། བྱང་ཆུབ་སེམས་དཔའ་དང་། འཕགས་པ་ཉན་ཐོས་དང་། རང་སངས་རྒྱས་འདས་པ་དང་། ད་ལྟར་གྱི་དང་། མ་བྱོན་པ་ཐམས་ཅད་ལ་ཕྱག་འཚལ་ལོ། །
en: Reverence to all the buddhas, bodhisattvas, noble disciples, and pratyekabuddhas, in the past, the present, and the future.

source: འདི་སྐད་བདག་གིས་ཐོས་པ་དུས་གཅིག་ན།
en: Thus did I hear on a single occasion.

source: ཆོས་ཀྱི་གྲོང་ཁྱེར་སྲུང་བ།
en: Guardians of the city of Dharma,

source: དམ་པའི་ཆོས་ཡོངས་སུ་འཛིན་པ།
en: they upheld the true doctrine,

source: བཅོམ་ལྡན་འདས་ཡངས་པའི་གྲོང་ཁྱེར་ན་ཨ་མྲ་སྲུང་བའི་ཚལ་ན། དགེ་སློང་བརྒྱད་སྟོང་གི་དགེ་སློང་གི་དགེ་འདུན་ཆེན་པོ་དང་ཐབས་ཅིག་ཏུ་བཞུགས་ཏེ།
en: The Lord Buddha was in residence in the garden of Āmrapālī, in the city of Vaiśālī, attended by a great gathering. Of bhikṣus there were eight thousand,

source: ཐམས་ཅད་ཀྱང་དགྲ་བཅོམ་པ།
en: all arhats.

source: ཟག་པ་ཟད་པ། ཉོན་མོངས་པ་མེད་པ།
en: They were free from impurities and afflictions,

source: དབང་དང་ལྡན་པར་གྱུར་པ།
en: and all had attained self-mastery.

source: སེམས་ཤིན་ཏུ་རྣམ་པར་གྲོལ་བ། ཤེས་རབ་ཤིན་ཏུ་རྣམ་པར་གྲོལ་བ།
en: Their minds were entirely liberated by perfect knowledge.

source: བྱ་བ་བྱས་པ།
en: They had accomplished their work,

source: བྱེད་པ་བྱས་པ།
en: done what they had to do,

source: ཁུར་བོར་བ།
en: cast off their burdens,

source: བདག་གི་དོན་རྗེས་སུ་ཐོབ་པ།
en: attained their goals,

source: སྲིད་པར་ཀུན་ཏུ་སྦྱོར་བ་ཡོངས་སུ་ཟད་པ།
en: and totally destroyed the bonds of existence.

source: ཡང་དག་པའི་ཤེས་པས་སེམས་ཤིན་ཏུ་རྣམ་པར་གྲོལ་བ།
en: Their true knowledge had made their minds entirely free.

source: སེམས་ཀྱི་དབང་ཐམས་ཅད་ཀྱི་དམ་པའི་ཕ་རོལ་དུ་སོན་པ་ཤ་སྟག་གོ།
en: They all had attained the utmost perfection of every form of control over their minds.

source: གསོལ་བ་མ་བཏབ་པར་སེམས་ཅན་ཐམས་ཅད་ཀྱི་དགེ་བའི་བཤེས་གཉེན་དུ་གྱུར་པ།
en: Without having to be asked, they were the natural spiritual benefactors of all living beings.

source: དཀོན་མཆོག་གསུམ་གྱི་རིགས་རྒྱུན་མི་འཆད་པར་བྱེད་པ།
en: They maintained unbroken the succession of the Three Jewels,

source: བདུད་དང་ཕྱིར་རྒོལ་བ་བཅོམ་པ་ཕ་རོལ་གྱི་རྒོལ་བ་ཐམས་ཅད་ཀྱི་ཟིལ་གྱིས་མི་ནོན་པ།
en: conquering devils and foes and overwhelming all critics.

source: དྲན་པ་དང་། བློ་གྲོས་དང་། རྟོགས་པ་དང་། ཏིང་ངེ་འཛིན་དང་། གཟུངས་དང་། སྤོབས་པ་ཕུན་སུམ་ཚོགས་པ།
en: Their mindfulness, intelligence, realization, meditation, incantation, and eloquence all were perfected.

source: སྒྲིབ་པ་དང་ཀུན་ནས་སྡང་བ་ཐམས་ཅད་དང་བྲལ་བ།
en: They were free of all obscurations and emotional involvements,

source: སྒྲིབ་པ་མེད་པའི་རྣམ་པར་ཐར་པ་ལ་གནས་པ།
en: living in liberation without impediment.

source: །བྱང་ཆུབ་སེམས་དཔའ་སུམ་ཁྲི་ཉིས་སྟོང་དང་ཡང་ཐབས་ཅིག་སྟེ།
en: Of bodhisattvas there were thirty-two thousand,

source: མངོན་པར་ཤེས་པ་མངོན་པར་ཤེས་པའི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་མངོན་པར་ཤེས་པ་ཆེན་པོ་ཡོངས་སུ་སྦྱངས་པ་ལས་ངེས་པར་བྱུང་བ།
en: great spiritual heroes who were universally acclaimed. They were dedicated through the penetrating activity of their great superknowledges

source: སངས་རྒྱས་ཀྱིས་བྱིན་གྱི་རླབས་ཀྱིས་བྱིན་གྱིས་བརླབས་པ།
en: and were sustained by the grace of the Buddha.

source: །དེ་ཡང་གང་ཞེ་ན།
en: What is that?

source: འདི་ལྟ་སྟེ། བྱང་ཆུབ་ཀྱི་རྣམ་པར་མངོན་པར་བསྒྲུབས་པའི་བྱམས་པ་ཆེན་པོ་དང་།
en: It consists of the great love which is consummated in enlightenment;

source: རྗེས་སུ་དྲན་པ་དྲུག་གིས་མངོན་པར་བསྒྲུབས་པའི་དྲན་པ་དང་།
en: of mindfulness, consummated by the six remembrances;

source: ཡང་དག་པར་དགའ་བར་འགྱུར་བའི་ཆོས་ཀྱིས་མངོན་པར་བསྒྲུབས་པའི་བསམ་པ་དང་།
en: of positive thought, consummated through the truly enjoyable Dharma;

source: །བྱང་ཆུབ་སེམས་དཔའ་དཔལ་བརྩེགས་ཀྱིས་སྨྲས་པ།
en: The bodhisattva Śrīkūṭa declared,

source: ཀུན་ནས་ཉོན་མོངས་པ་དང་། རྣམ་པར་བྱང་བ་ཞེས་བྱ་བ་དེ་ནི་གཉིས་ཏེ།
en: “ ‘Defilement’ and ‘purification’ are two.

source: །བྱང་ཆུབ་སེམས་དཔའ་སྐར་བཟངས་ཀྱིས་སྨྲས་པ།
en: The bodhisattva Sunakṣatra declared,

source: གཡོ་བ་དང་རློམ་སེམས་དེ་ནི་གཉིས་ཏེ།
en: “ ‘Distraction’ and ‘attention’ are two.

source: གང་གཡོ་བ་མེད་ཅིང་རློམ་སེམས་སུ་མི་བྱེད། ཡིད་ལ་མི་བྱེད། ལྷག་པར་བྱ་བ་མེད་པ།
en: When there is no distraction, there will be no attention, no mentation, and no mental intensity.

source: ལྷག་པར་བྱ་བ་དང་བྲལ་བ་དེ་ནི་གཉིས་སུ་མེད་པར་འཇུག་པའོ།
en: Thus, the absence of mental intensity is the entrance into nonduality.”

source: །བྱང་ཆུབ་སེམས་དཔའ་ལག་བཟངས་ཀྱིས་སྨྲས་པ།
en: The bodhisattva Subāhu declared,

source: བྱང་ཆུབ་ཀྱི་སེམས་དང་། ཉན་ཐོས་ཀྱི་སེམས་ཞེས་བྱ་བ་དེ་ནི་གཉིས་ཏེ།
en: “ ‘Bodhisattva spirit’ and ‘disciple spirit’ are two.

source: གང་སྒྱུ་མའི་སེམས་དང་མཚུངས་པར་མཐོང་བ་དེ་ནི་བྱང་ཆུབ་ཀྱི་སེམས་ཀྱང་མེད། ཉན་ཐོས་ཀྱི་སེམས་ཀྱང་མེད་དེ།
en: When both are seen to resemble an illusory spirit, there is no bodhisattva spirit, nor any disciple spirit.

source: གང་སེམས་ཀྱི་མཚན་ཉིད་མཚུངས་པ་དེ་ནི་གཉིས་སུ་མེད་པར་འཇུག་པའོ།
en: Thus, the sameness of natures of spirits is the entrance into nonduality.”

source: །བྱང་ཆུབ་སེམས་དཔའ་མིག་མི་འཛུམས་ཀྱིས་སྨྲས་པ།
en: The bodhisattva Animiṣa declared,

source: ལེན་པ་དང་མི་ལེན་པ་དེ་ནི་གཉིས་ཏེ།
en: “ ‘Grasping’ and ‘nongrasping’ are two.

source: གང་མི་ལེན་པ་དེ་མི་དམིགས་པ་སྟེ།
en: What is not grasped is not perceived,

source: གང་མི་དམིགས་པ་དེ་ལ་རྟོག་པ་དང་བསལ་བར་མི་བྱེད།
en: and what is not perceived is neither presumed nor repudiated.

source: ཆོས་ཐམས་ཅད་མི་བྱེད་མི་སྤྱོད་པ་དེ་ནི་གཉིས་སུ་མེད་པར་འཇུག་པའོ།
en: Thus, the inaction and non-involvement of all things is the entrance into nonduality.”

source: །བྱང་ཆུབ་སེམས་དཔའ་མིག་བཟངས་ཀྱིས་སྨྲས་པ།
en: The bodhisattva Sunetra declared,

source: མཚན་ཉིད་གཅིག་པ་དང་མཚན་ཉིད་མེད་པ་ཞེས་བྱ་བ་དེ་ནི་གཉིས་སོ།
en: “ ‘Uniqueness’ and ‘characterlessness’ are two.

source: །བྱང་ཆུབ་སེམས་དཔའ་སྐར་རྒྱལ་གྱིས་སྨྲས་པ།
en: The bodhisattva Puṣya declared,

source: དགེ་བ་དང་མི་དགེ་བ་ཞེས་བྱ་བ་དེ་ནི་གཉིས་ཏེ།
en: “ ‘Good’ and ‘evil’ are two.

source: གང་དགེ་བ་དང་མི་དགེ་བ་མི་སློང་ཞིང་མཚན་མ་དང་མཚན་མ་མེད་པ་ལ་གཉིས་སུ་མེད་པར་རྟོག་པ་ནི་གཉིས་སུ་མེད་པར་འཇུག་པའོ།
en: Seeking neither good nor evil, the understanding of the nonduality of the significant and the meaningless is the entrance into nonduality.”

source: །བྱང་ཆུབ་སེམས་དཔའ་སེང་གེས་སྨྲས་པ།
en: The bodhisattva Siṃha declared,

source: ཁ་ན་མ་ཐོ་བ་དང་བཅས་པ་དང་། ཁ་ན་མ་ཐོ་བ་མེད་པ་ཞེས་བྱ་བ་དེ་ནི་གཉིས་ཏེ།
en: “ ‘Sinfulness’ and ‘sinlessness’ are two.

source: གང་གིས་རྡོ་རྗེ་ལྟར་རབ་ཏུ་འབིགས་པའི་ཡེ་ཤེས་ཀྱིས་མི་འཆིང་མི་འགྲོལ་བ་དེ་ནི་གཉིས་སུ་མེད་པར་འཇུག་པའོ།
en: By means of the diamond-like wisdom that pierces to the quick, not to be bound or liberated is the entrance into nonduality.”

source: སྨན་པའི་རྒྱལ་པོ་ཆེན་པོ།
en: Great Kings of medicine,

source: ཡང་དག་པའི་ནན་ཏན་གྱིས་མངོན་པར་བསྒྲུབས་པའི་འཚོ་བ་ཡོངས་སུ་དག་པ་དང་།
en: of purity of livelihood, consummated by correct spiritual practice;

source: དད་པ་དང་མཆོག་ཏུ་དགའ་བ་ལ་བསྟེན་པས་མངོན་པར་བསྒྲུབས་པའི་འཕགས་པ་ལ་བསྙེན་བཀུར་བྱེད་པ་དང་།
en: of the respect of noble ones, consummated by joyful and faithful service;

source: འཕགས་པ་མ་ཡིན་པ་ལ་ཁོང་ཁྲོ་བ་མེད་པས་མངོན་པར་བསྒྲུབས་པའི་སེམས་ངེས་པར་སེམས་པ་དང་།
en: of soberness of mind, consummated by absence of dislike for ordinary people;

source: རབ་ཏུ་བྱུང་བས་མངོན་པར་བསྒྲུབས་པའི་ལྷག་པའི་བསམ་པ་དང་།
en: of high resolve, consummated by renunciation;

source: ནན་ཏན་གྱིས་མངོན་པར་བསྒྲུབས་པའི་ཐོས་པ་ལ་མཁས་པ་དང་།
en: of skill in erudition, consummated by religious practice;

source: ཉོན་མོངས་པ་མེད་པའི་ཆོས་རྟོགས་པས་མངོན་པར་བསྒྲུབས་པའི་དགོན་པ་ལ་གནས་པ་དང་།
en: of retirement in solitary retreats, consummated by understanding things free of afflictions;

source: སངས་རྒྱས་ཀྱི་ཡེ་ཤེས་འཐོབ་པར་བྱེད་པས་མངོན་པར་བསྒྲུབས་པའི་ནང་དུ་ཡང་དག་འཇོག་པ་དང་།
en: of introspective meditation, consummated by attainment of the buddha-gnosis;

source: སེམས་ཅན་ཐམས་ཅད་ཉོན་མོངས་པ་ལས་རྣམ་པར་གྲོལ་བའི་རྣལ་འབྱོར་གྱིས་མངོན་པར་བསྒྲུབས་པའི་རྣལ་འབྱོར་སྤྱོད་པའི་ས་དང་།
en: of the stage of the practice of yoga, consummated by the yoga of liberating all living beings from their afflictions.

source: བསྐལ་པ་བྱེ་བ་ཁྲག་ཁྲིག་བརྒྱ་སྟོང་དཔག་ཏུ་མེད་པར་ཡོན་ཏན་ཡོངས་སུ་བརྗོད་ཀྱང་ཡོན་ཏན་གྱི་ཆུ་བོ་མཐའ་ཡས་པར་རྟོགས་པ་ལ་འདི་ལྟ་སྟེ།
en: Were one to extol them for innumerable hundreds of thousands of myriads of eons, one still could not exhaust their mighty flood of virtues.

source: སངས་རྒྱས་ཀྱི་ཞིང་མཐའ་ཡས་པར་ཡོན་ཏན་བཀོད་པས་ལེགས་པར་བརྒྱན་པ་མཐོང་བ་དང་། ཐོས་པ་འབྲས་བུ་ཡོད་པ། གོམ་པ་འདོར་བ་འབྲས་བུ་ཡོད་པ།
en: and they glorified innumerable buddhafields with the splendor of these virtues. They conferred great benefit when seen, heard, or even approached.

source: ཅི་རིགས་པར་ཆོས་ཀྱི་སྨན་སྦྱར་བ་རབ་ཏུ་སྦྱོར་བ།
en: they could apply the medicine of the Dharma appropriately.

source: ཡོན་ཏན་མཐའ་ཡས་པའི་འབྱུང་གནས་དང་ལྡན་པ།
en: They were inexhaustible mines of limitless virtues,

source: །བཅོམ་ལྡན་འདས་དེ་ལྟ་བུར་ཁྱིམ་བདག་དེས་བསྟན་པ་འདི་བཤད་པའི་ཚེ་བྲམ་ཟེའི་འཁོར་དེ་ནས་བྲམ་ཟེ་ཉིས་བརྒྱ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་སེམས་སྐྱེས་སོ།
en: “Lord, as soon as the householder had discoursed thus, two hundred brahmins among the crowd of brahmins present conceived the spirit of unexcelled, perfect enlightenment.

source: །དེ་བཞིན་དུ་གཞན་ཡང་དབང་ཆེ་བ། དབང་ཆེ་བར་གྲགས་པའི་ཚངས་པ་དང་། བརྒྱ་བྱིན་དང་། འཇིག་རྟེན་སྐྱོང་དང་། ལྷ་དང་། ཀླུ་དང་། གནོད་སྦྱིན་དང་། དྲི་ཟ་དང་། ལྷ་མ་ཡིན་དང་། ནམ་མཁའ་ལྡིང་དང་། མིའམ་ཅི་དང་། ལྟོ་འཕྱེ་ཆེན་པོ་རྣམས་ཀྱང་འཁོར་དེ་ཉིད་དུ་འདུས་པར་གྱུར་ཏོ།
en: And there were other powerful gods: Brahmās, Śakras, Lokapālas, devas, nāgas, yakṣas, gandharvas, asuras, garuḍas, kiṃnaras, and mahoragas.

source: །དེ་བཞིན་དུ་འཁོར་བཞི་པོ་དགེ་སློང་དང་། དགེ་སློང་མ་དང་། དགེ་བསྙེན་དང་། དགེ་བསྙེན་མ་རྣམས་ཀྱང་དེར་ལྷགས་སོ།
en: Finally, there was the fourfold community, consisting of bhikṣus, bhikṣuṇīs, laymen, and laywomen.

source: །དེ་ནས་བཅོམ་ལྡན་འདས་དཔལ་གྱི་སྙིང་པོའི་སེང་གེའི་ཁྲི་ལ་བཞུགས་ཏེ། འཁོར་བརྒྱ་སྟོང་དུ་མས་ཡོངས་སུ་བསྐོར་ཅིང་མདུན་གྱིས་བལྟས་ནས་ཆོས་སྟོན་ཏོ།
en: The Lord Buddha, thus surrounded and venerated by these multitudes of many hundreds of thousands of living beings, sat upon a majestic lion-throne and began to teach the Dharma.

source: །རྒྱ་མཚོའི་ནང་ནས་རིའི་རྒྱལ་པོ་རི་རབ་མངོན་པར་འཕགས་པ་བཞིན་དུ་འཁོར་ཐམས་ཅད་ཟིལ་གྱིས་མནན་ཏེ་ལམ་མེ་ལྷན་ནེ་ལྷང་ངེར་དཔལ་གྱི་སྙིང་པོའི་སེང་གེའི་ཁྲི་ལ་བཞུགས་སོ།
en: Dominating all the multitudes, just as Sumeru, the king of mountains, looms high over the oceans, the Lord Buddha shone, radiated, and glittered as he sat upon his magnificent lion-throne.

source: མུ་ཏིག་གི་དོ་ཤལ་བརྒྱ་སྟོང་རི་བ་བདག་གི་མགུལ་ནས་བཀྲོལ་ཏེ་སྩལ་ན།
en: took from around my neck a necklace of pearls worth one hundred thousand pieces of gold and offered it to him.

source: དེར་མུ་ཏིག་གི་དོ་ཤལ་བླངས་ཏེ་དུམ་བུ་གཉིས་སུ་བགྱིས་ན།
en: ’“Then, Vimalakīrti took the pearls and divided them into two halves.

source: །སྟོང་གསུམ་གྱི་སྟོང་ཆེན་པོའི་འཇིག་རྟེན་གྱི་ཁམས་ཀྱི་ཆུ་ཞེང་དེ་དག་ཀྱང་རིན་པོ་ཆེའི་གདུགས་ཆེན་པོ་དེ་ཉིད་ཀྱི་ནང་ན་སྣང་ངོ་།
en: The surface of the entire billion-world galaxy was reflected in the interior of the great precious canopy,

source: ཆ་གཅིག་ནི་མཆོད་སྦྱིན་གྱི་གནས་དེ་ན་འཇིག་རྟེན་ཐམས་ཅད་ཀྱིས་སྨད་པ་གྲོང་ཁྱེར་གྱི་ནང་ན་དབུལ་པོ་ལ་སྩལ་ཏོ།
en: He gave one half of them to the lowliest poor of the city, who had been disdained by those present at the sacrifice.

source: །དེ་ནས་བཅོམ་ལྡན་འདས་ལས་དེ་ལྟ་བུའི་ཆོ་འཕྲུལ་ཆེན་པོ་འདི་མཐོང་ནས་ཐམས་ཅད་དང་ལྡན་པའི་འཁོར་དེ་ངོ་མཚར་དུ་གྱུར་ཏེ།
en: At this vision of the magnificent miracle effected by the supernatural power of the Lord Buddha, the entire host was ecstatic, enraptured, astonished,

source: །ཕྱོགས་བཅུའི་འཇིག་རྟེན་ན་སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་ཀྱི་ཆོས་སྟོན་པ་གང་འབྱུང་བ་དེ་ཡང་རིན་པོ་ཆེའི་གདུགས་ཆེན་པོ་གཅིག་པོ་དེ་ལས་འབྱུང་བའི་སྒྲར་གྲག་གོ།
en: And the voices of all the buddhas of the ten directions could be heard proclaiming their teachings of the Dharma in all the worlds, the sounds reverberating in the space beneath the great precious canopy.

source: །ཆ་གཅིག་ནི་དེ་བཞིན་གཤེགས་པ་བཟོད་པར་དཀའ་བ་ལ་ཕུལ་ཏེ།
en: The other half he offered to the Tathāgata Duṣprasaha.

source: གྲོང་དང་། གྲོར་ཁྱེར་དང་། གྲོང་རྡལ་དང་། ཡུལ་འཁོར་དང་། རྒྱལ་པོའི་ཕོ་བྲང་འཁོར་ཇི་སྙེད་ཡོད་པ་དེ་དག་ཐམས་ཅད་ཀྱང་རིན་པོ་ཆེའི་གདུགས་ཆེན་པོ་གཅིག་པོ་དེ་ཉིད་ཀྱི་ནང་ན་སྣང་ངོ་།
en: finally, all the villages, suburbs, cities, capitals, provinces, and wildernesses. All this could be clearly seen by everyone.

source: དེ་ན་གྲོང་ཁྱེར་གྱི་དབུལ་པོ་དེས་ཆོ་འཕྲུལ་དེ་མཐོང་། ཆོས་བསྟན་པ་དེ་ཡང་ཐོས་ནས་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་སེམས་བསྐྱེད་དོ།
en: “Then the poor of the city, having seen that miracle and having heard that teaching, conceived the spirit of unexcelled, perfect enlightenment.

source: །བཅོམ་ལྡན་འདས་དེའི་སླད་དུ་བདག་སྐྱེས་བུ་དམ་པ་དེའི་བྲོ་འདྲི་ཞིང་མཆི་བར་མི་སྤྲོའོ།
en: Therefore, Lord, I am reluctant to go to that good man to inquire about his illness.”

source: རིན་པོ་ཆེའི་གདུགས་དེས་སྟོང་གསུམ་གྱི་སྟོང་ཆེན་པོའི་འཇིག་རྟེན་གྱི་ཁམས་འདི་ཐམས་ཅད་ཁེབས་པར་སྣང་ངོ་།
en: so great that it formed a covering for this entire billion-world galaxy.

source: །འཇམ་དཔལ་གྱིས་ཀྱང་གསོལ་པ།
en: Mañjuśrī replied,

source: ཚིམ་ཞིང་མགུ་ནས་ཡི་རངས་ཏེ།
en: delighted, satisfied,

source: རབ་ཏུ་དགའ་ཞིང་དགའ་བ་དང་། ཡིད་བདེ་བ་སྐྱེས་ནས་དེ་བཞིན་གཤེགས་པ་ལ་ཕྱག་འཚལ་ཏེ།
en: and filled with awe and pleasure. They all bowed down to the Tathāgata,

source: །གཙང་ཞིང་མཛེས་པ་པད་མའི་འདབ་ལྟར་ཡངས་པའི་སྤྱན།
en: “Pure are your eyes, broad and beautiful, like the petals of a blue lotus.

source: །དགོངས་པ་དག་ཅིང་ཞི་གནས་ཕ་རོལ་ཕྱིན་མཆོག་བརྙེས།
en: Pure is your thought, having discovered the supreme transcendence of all trances.

source: །བདེ་བར་གཤེགས་པའི་ཞིང་མཆོག་རབ་གསལ་ཀུན་ཀྱང་གདའ།
en: The superb and radiant fields of the sugatas appear before us,

source: །ཁྱོད་ཀྱི་ཆོས་ཀྱི་བཀའ་མཆིད་རྒྱ་ཆེ་འཆི་མེད་འགྲོ། །དེ་དག་ཐམས་ཅད་ནམ་མཁའ་འདི་ཡི་དཀྱིལ་ན་གདའ།
en: And your extensive spiritual teachings that lead to immortality Make themselves heard throughout the whole reach of space.

source: །ཆོས་རྣམས་རབ་ཏུ་འབྱེད་མཁས་དོན་དམ་སྟོན་མཛད་པ།
en: Expert in the deep analysis of things, you teach their ultimate meaning.

source: མིག་མི་འཛུམས་པར་ལྟ་ཞིང་འཁོད་དོ།
en: and gazed upon him with fixed attention.

source: །ཆོས་ཀྱི་དབང་ཕྱུག་ཆོས་རྒྱལ་ཁྱོད་ལ་མགོས་ཕྱག་འཚལ།
en: Sovereign Lord of Dharma, obeisance to you!

source: །ཆོས་འདི་ཐམས་ཅད་རྒྱུ་ལས་བརྟེན་ནས་འབྱུང་བ་དང་།
en: “All these things arise dependently, from causes,

source: །མཆིས་པ་མ་ལགས་པ་དང་མ་མཆིས་མ་ལགས་དང་།
en: Yet they are neither existent nor nonexistent.

source: །དེ་ཚེ་དཀོན་མཆོག་གསུམ་པོ་དག་ཀྱང་ཉེ་བར་བསྟན།
en: And thereby the Three Jewels were revealed.

source: བྱང་ཆུབ་སེམས་དཔའི་བགྱི་བ་ཐམས་ཅད་ཚར་ཕྱིན་པ།
en: He accomplishes all the activities of the bodhisattvas.

source: བྱང་ཆུབ་སེམས་དཔའ་ཐམས་ཅད་དང་། སངས་རྒྱས་ཐམས་ཅད་ཀྱི་གསང་བའི་གནས་ལ་ཤིན་ཏུ་ཞུགས་པ།
en: He penetrates all the secret mysteries of the bodhisattvas and the buddhas.

source: །ཁྱོད་ཀྱིས་དཀོན་མཆོག་ཆོས་ཀྱིས་ལེགས་པར་གང་བཏུལ་བ། །དེ་དག་རྟོག་པ་མ་མཆིས་རྟག་པར་རབ་ཏུ་ཞི།
en: “Those who are well disciplined by your precious Dharma Are free of vain imaginings and always deeply peaceful.

source: བདུད་ཐམས་ཅད་ཀྱི་གནས་རྣམ་པར་བཟློག་པ་ལ་མཁས་པ།
en: He is skilled in civilizing all the abodes of devils.

source: མངོན་པར་ཤེས་པ་ཆེན་པོས་རྣམ་པར་རྩེན་པ།
en: He plays with the great superknowledges.

source: ཐབས་དང་ཤེས་རབ་ལས་ངེས་པར་འབྱུང་བ།
en: He is consummate in wisdom and liberative art.

source: །ཁྱོད་ནི་སྐྱེ་རྒ་ན་འཆི་མཐར་འབྱིན་སྨན་པའི་མཆོག །ཡོན་ཏན་རྒྱ་མཚོ་དཔག་མི་ལང་ལ་མགོས་ཕྱག་འཚལ།
en: Supreme doctor, you put an end to birth, decay, sickness, and death. Immeasurable ocean of virtue, we bow to you!

source: །བསྟི་སྟང་ལེགས་པར་བགྱིས་པས་མི་བསྐྱོད་རི་རབ་བཞིན།
en: “Like Mount Sumeru, you are unmoved by honor or scorn.

source: །ཚུལ་ཁྲིམས་ལྡན་དང་ཚུལ་ཁྲིམས་འཆལ་ལ་མཚུངས་པར་བྱམས།
en: You love moral beings and immoral beings equally.

source: །མཉམ་པ་ཉིད་ལ་བཞུགས་ཤིང་ཐུགས་ཀྱང་ནམ་མཁའ་བཞིན།
en: Poised in equanimity, your mind is like the sky.

source: །སེམས་ཅན་དཀོན་མཆོག་འདི་ལ་སུ་ཞིག་མཆོད་མི་བགྱིད།
en: Who would not honor such a precious jewel of a being?

source: །ཐུབ་པ་ཆེན་པོ་འཁོར་རྣམས་འདུས་པ་འདི་དག་ནི།
en: “Great Sage, in all these multitudes gathered here,

source: །ཁྱོད་ཀྱི་ཞལ་དུ་རབ་ཏུ་དད་པའི་ཡིད་ཀྱིས་ལྟ།
en: Who look upon your countenance with hearts sincere in faith,

source: །ཐམས་ཅད་ཀྱིས་ཀྱང་རྒྱལ་བ་རང་གི་མདུན་གནས་མཐོང་།
en: Each being beholds the Victor, as if just before him.

source: །དེ་ནི་རྒྱལ་བའི་མ་འདྲེས་སངས་རྒྱས་མཚན་ལགས་སོ། །བཅོམ་ལྡན་འདས་ཀྱི་གསུང་གཅིག་རབ་ཏུ་ཕྱུང་བ་ཡང་།
en: This is a special quality of the Buddha. “Although the Lord speaks with but one voice,

source: །འཁོར་རྣམས་ཀྱིས་ནི་གསུང་ལ་ཐ་དད་རྣམ་པར་རིག །
en: Those present perceive that same voice differently,

source: འགྲོ་བ་དག་གིས་རང་གི་དོན་བཞིན་རྣམ་རིག་པ།
en: And each understands in his own language according to his own needs.

source: །དེ་ནི་རྒྱལ་བའི་མ་འདྲེས་སངས་རྒྱས་མཚན་ལགས་སོ། །གསུང་གཅིག་རབ་ཏུ་བསྒྲགས་པ་མཛད་པ་དེ་ཡིས་ནི།
en: This is a special quality of the Buddha. “From the leader’s act of speaking in a single voice,

source: །ཁ་ཅིག་བག་ཆགས་བསྒོས་ཤིང་ཁ་ཅིག་རྟོགས་པར་བྱས།
en: Some merely develop an instinct for the teaching, some gain realization,

source: །སོམ་ཉི་འཚལ་བ་འདྲེན་པས་རབ་ཏུ་ཞི་མཛད་དེ།
en: Some find pacification of all their doubts.

source: །དེ་ནི་རྒྱལ་བའི་མ་འདྲེས་སངས་རྒྱས་མཚན་ལགས་སོ། །སྟོབས་བཅུ་འདྲེན་པའི་རྩལ་མངའ་ཁྱོད་ལ་ཕྱག་འཚལ་ལོ།
en: This is a special quality of the Buddha. “We bow to you who command the force of leadership and the ten powers!

source: །དུབ་པའི་འགྲོ་བ་སྒྲོལ་བ་ཁྱོད་ལ་ཕྱག་འཚལ་ལོ། །འཁོར་བའི་འགྲོ་བར་མི་གནས་པ་ལ་ཕྱག་འཚལ་ལོ།
en: We bow to you who save the suffering beings! We bow to you who do not remain in the migrations!

source: །སེམས་ཅན་རྣམས་དང་འགྲོ་བར་ཞུགས་ཤིང་ཀུན་འགྲོགས་ཀྱང་།
en: “You associate with living beings by frequenting their migrations,

source: འཇམ་དཔལ་དེ་ནི་བྱང་ཆུབ་སེམས་དཔའི་བྱམས་པ་ཆེན་པོའོ།
en: Such, Mañjuśrī, is the great love of a bodhisattva.”

source: ། འགྲོ་བ་ཐམས་ཅད་ལས་ནི་རྣམ་པར་གྲོལ་བའི་ཐུགས།
en: Yet your mind is liberated from all migrations.

source: །པད་མ་དག་ནི་ཆུ་སྐྱེས་ཆུ་ཡིས་ཡོང་མི་གོས། །ཐུབ་པའི་པད་མས་སྟོང་པ་ཉིད་ནི་ངེས་པར་བསྒོམས།
en: Just as the lotus, born of mud, is not tainted thereby, So the lotus of the Buddha preserves the realization of voidness.

source: །མཚན་མ་ཐམས་ཅད་རྣམ་པ་ཀུན་ཏུ་རབ་ཏུ་བསལ།
en: “You nullify all signs in all things everywhere.

source: །ཁྱོད་ནི་ཅི་ལའང་སྨོན་པར་མཛད་པ་ཡོང་མི་མངའ།
en: You are not subject to any wish for anything at all.

source: །སངས་རྒྱས་དག་གི་མཐུ་ཆེན་བསམ་གྱིས་མི་ཁྱབ་སྟེ།
en: The miraculous power of the buddhas is inconceivable.

source: །ནམ་མཁའ་ལྟ་བུར་མི་གནས་པ་ལ་བདག་ཕྱག་འཚལ།
en: We bow to you, who stand nowhere, like infinite space.”

source: །དེ་ནས་བཅོམ་ལྡན་འདས་ལ་ལིད་ཙ་བཱི་གཞོན་ནུ་དཀོན་མཆོག་འབྱུང་གནས་ཀྱིས་ཚིགས་སུ་བཅད་པ་དེ་དག་གིས་མངོན་པར་བསྟོད་ནས་བཅོམ་ལྡན་འདས་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ།
en: Then, the young Licchavi Ratnākara, having celebrated the Buddha with these verses, further addressed him,

source: །བཅོམ་ལྡན་འདས་ལིད་ཙ་བཱི་གཞོན་ནུ་ལྔ་བརྒྱ་ཙམ་པོ་འདི་དག་ཐམས་ཅད་ཀྱང་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་ཡང་དག་པར་ཞུགས་ཏེ།
en: “Lord, these five hundred young Licchavis are truly on their way to unexcelled, perfect enlightenment,

source: །སངས་རྒྱས་ཀྱི་བདེ་བ་ལ་འགོད་པའི་ཕྱིར་བདེ་བའི་བྱམས་པ་སྟེ།
en: the love that is happiness because it introduces living beings to the happiness of the Buddha.

source: །བཅོས་མ་མ་ཡིན་པའི་ཕྱིར་སྒྱུ་མེད་པའི་བྱམས་པའོ།
en: the love that is without deceit because it is not artificial;

source: །ཉོན་མོངས་པ་མེད་པའི་ཕྱིར་ལྷག་པའི་བསམ་པའི་བྱམས་པའོ།
en: the love that is high resolve because it is without passions;

source: །བསམ་པ་ཐག་པ་ནས་བྱེད་པའི་ཕྱིར་གཡོ་མེད་པའི་བྱམས་པའོ།
en: the love that is without deviation because it acts from decisive motivation;

source: །དེའི་ཕྱིར་གཞོན་ནུ་ཁྱོད་ལེགས་པར་རབ་ཏུ་ཉོན་ལ་ཡིད་ལ་ཟུང་ཤིག་དང་།
en: Therefore, young man, listen well and remember!

source: བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་སངས་རྒྱས་ཀྱི་ཞིང་ཡོངས་སུ་དག་པ་ལས་བརྩམས་ཏེ་ངས་ཁྱོད་ལ་བཤད་དོ།
en: I will explain to you the purification of the buddhafield of the bodhisattvas.”

source: །བསམ་པ་རྣམ་པར་དག་པའི་ཕྱིར་ཚུལ་འཆོས་པ་མེད་པའི་བྱམས་པའོ།
en: the love that is without formality because it is pure in motivation;

source: །ཐམས་ཅད་དུ་སྒོ་སྟོན་པའི་ཕྱིར་ཐབས་ཀྱི་བྱམས་པའོ།
en: the love that is liberative art because it shows the way everywhere;

source: །དུས་སུ་ཐོབ་པར་བྱེད་པའི་ཕྱིར་ཤེས་རབ་ཀྱི་བྱམས་པའོ།
en: the love that is wisdom because it causes attainment at the proper time;

source: །རོ་མྱང་བ་མེད་པའི་ཕྱིར་བསམ་གཏན་གྱི་བྱམས་པའོ།
en: the love that is contemplation because it refrains from indulgence in tastes;

source: །སེམས་ཅན་ཐམས་ཅད་ཀྱི་ཁུར་ཁྱེར་བའི་ཕྱིར་བརྩོན་འགྲུས་ཀྱི་བྱམས་པའོ།
en: the love that is effort because it takes responsibility for all living beings;

source: །བདག་དང་ཕ་རོལ་སྲུང་བའི་ཕྱིར་བཟོད་པའི་བྱམས་པའོ།
en: the love that is tolerance because it protects both self and others;

source: །ཚུལ་ཁྲིམས་འཆལ་པའི་སེམས་ཅན་ལ་ལྟ་བའི་ཕྱིར་ཚུལ་ཁྲིམས་ཀྱི་བྱམས་པའོ།
en: the love that is morality because it improves immoral living beings;

source: །སློབ་དཔོན་དཔེ་མཁྱུད་མེད་པའི་ཕྱིར་ཆོས་ཀྱི་སྦྱིན་པའི་བྱམས་པའོ།
en: the love that is giving because it bestows the gift of Dharma free of the tight fist of a bad teacher;

source: །དཀོན་མཆོག་འབྱུང་གནས་འདི་ལྟ་སྟེ་དཔེར་ན་ནམ་མཁའ་ལ་ཇི་ལྟ་བུར་བྱ་བ་འདོད་པ་དེ་བཞིན་དུ་བྱེད་མོད་ཀྱི་ནམ་མཁའ་ལ་ནི་བྱར་མི་རུང་ཞིང་བརྒྱན་དུ་ཡང་མི་རུང་བ་དེ་བཞིན་དུ།
en: “For example, Ratnākara, should one wish to build in empty space, one might go ahead in spite of the fact that it is not possible to build or to adorn anything in empty space.

source: །སངས་རྒྱས་ཀྱི་ཞིང་ལ་འཇུག་པ་ཇི་ལྟ་བུས་སེམས་ཅན་རྣམས་འཕགས་པ་ལྟ་བུས་དབང་པོ་སྐྱེ་བར་འགྱུར་བ་དེ་ལྟ་བུས་སངས་རྒྱས་ཀྱི་ཞིང་ཡོངས་སུ་འཛིན་ཏོ།
en: He embraces a buddhafield to the same extent that, through entrance into that buddhafield, living beings increase their noble spiritual faculties.

source: །སངས་རྒྱས་ཀྱི་ཞིང་ལ་འཇུག་པ་ཇི་ལྟ་བུས་སེམས་ཅན་རྣམས་སངས་རྒྱས་ཀྱི་ཡེ་ཤེས་ལ་འཇུག་པར་འགྱུར་བ་དེ་ལྟ་བུའི་སངས་རྒྱས་ཀྱི་ཞིང་ཡོངས་སུ་འཛིན་ཏོ།
en: He embraces a buddhafield to the same extent that, through entrance into a buddhafield, living beings are introduced to the buddha-gnosis.

source: །སེམས་ཅན་རྣམས་ཇི་ལྟ་བུས་འདུལ་བར་འགྱུར་བ་དེ་ལྟ་བུའི་སངས་རྒྱས་ཀྱི་ཞིང་ཡོངས་སུ་འཛིན་ཏོ།
en: He embraces a buddhafield to the same extent that living beings become disciplined.

source: བཅོམ་ལྡན་འདས་ཀྱིས་དེ་དག་ལ་འདི་སྐད་ཅེས་བཀའ་སྩལ་ཏོ།
en: The Buddha said,

source: དེ་ལྟར་ཆོས་ཐམས་ཅད་ནི་རྟེན་མེད་པའི་རྩ་བ་ལ་གནས་པའོ།
en: Therefore, all things stand on the root that is baseless.

source: །དེ་ནས་ཁྱིམ་དེ་ན་གང་གནས་པའི་ལྷ་མོ་དེས་
en: Thereupon, a certain goddess who lived in that house,

source: །རིགས་ཀྱི་བུ་སེམས་ཅན་གྱི་ཞིང་ནི་བྱང་ཆུབ་སེམས་དཔའི་སངས་རྒྱས་ཀྱི་ཞིང་ངོ་།
en: “Noble son, a buddhafield of bodhisattvas is a field of living beings.

source: ལིད་ཙ་བཱི་གཞོན་ནུ་ལྔ་བརྒྱ་ཙམ་པོ་དེ་དག་བཅོམ་ལྡན་འདས་ཀྱི་ལྟར་ཉན་པ་དང་།
en: and the five hundred young Licchavis, and they set themselves to listen.

source: བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་དེ་དག་གི་ཆོས་བསྟན་པ་འདི་ཐོས་ནས་དགའ་ཞིང་མགུ་ལ་ཡི་རངས་ཏེ།
en: having heard this teaching of the Dharma of the great heroic bodhisattvas, and being delighted, pleased, and overjoyed,

source: བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པས་བྱང་ཆུབ་སེམས་དཔའ་དེ་དག་ལ་སངས་རྒྱས་ཀྱི་ཞིང་ཡོངས་སུ་དག་པ་ལེགས་པར་བཤད་དུ་གསོལ།
en: Please, Lord, explain to them the bodhisattvas’ purification of the buddhafield!”

source: འདི་དག་ཀྱང་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་སངས་རྒྱས་ཀྱི་ཞིང་ཡོངས་སུ་དག་པ་གང་ལགས་ཞེས་སངས་རྒྱས་ཀྱི་ཞིང་ཡོངས་སུ་དག་པ་ཞུ་ན།
en: and they have asked what is the bodhisattvas’ purification of the buddhafield.

source: །དཀོན་མཆོག་འབྱུང་གནས་འོན་ཀྱང་བསམ་པའི་ཞིང་ནི་བྱང་ཆུབ་སེམས་དཔའི་སངས་རྒྱས་ཀྱི་ཞིང་སྟེ།
en: “Yet, Ratnākara, a bodhisattva’s buddhafield is a field of positive thought.

source: །དེ་ནས་ཉན་ཐོས་ཆེན་པོ་དེ་དག་རྫུ་འཕྲུལ་གྱི་ཆོ་འཕྲུལ་གྱིས་མེ་ཏོག་དེ་དག་སྤྲུགས་ཀྱང་མ་ལྷུང་ངོ་།
en: The great disciples shook the flowers and even tried to use their magical powers, but still the flowers would not shake off.

source: དེ་བྱང་ཆུབ་ཐོབ་པའི་སངས་རྒྱས་ཀྱི་ཞིང་དུ་སེམས་ཅན་གཡོ་མེད་པ་དང་། སྒྱུ་མེད་པ་རྣམས་སྐྱེ་བར་འགྱུར་རོ།
en: When he attains enlightenment, living beings free of hypocrisy and deceit will be born in his buddhafield.

source: །དེ་ནས་ལྷ་མོ་དེས་ཚེ་དང་ལྡན་པ་ཤཱ་རིའི་བུ་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ།
en: Then, the goddess said to the venerable Śāriputra,
